{
  "questions": [
    "What programming languages are you proficient in?",
    "How many years of experience do you have in software development?",
    "Are you available for full-time work?",
    "What is your experience with cloud platforms?",
    "Can you describe your experience with database management?",
    "What is your experience with CI/CD pipelines?",
    "What's your preferred development environment?",
    "What is your experience with test-driven development?",
    "Can you describe a challenging project you've worked on?",
    "What is your experience with microservices architecture?",
    "Have you worked with containerization technologies like Docker?",
    "What is your experience with front-end frameworks?",
    "What is your experience with API design and development?",
    "What is your experience with big data technologies?",
    "What is your experience with serverless architectures?",
    "What is your experience with mobile app development?",
    "What is your experience with DevOps practices?",
    "Have you ever had to migrate a large-scale application?",
    "What is your experience with blockchain technology?",
    "What is your experience with machine learning frameworks?",
    "What is your experience with IoT development?",
    "What is your experience with data visualization tools?",
    "What is your experience with functional programming?",
    "What is your experience with cloud-native development?",
    "What is your experience with real-time systems?",
    "What is your experience with data structures and algorithms?",
    "What is your experience with web accessibility standards?",
    "What is your experience with distributed systems?",
    "What is your experience with agile project management tools?",
    "What is your experience with cross-platform development?",
    "What is your experience with code optimization techniques?",
    "What is your experience with database design and optimization?",
    "What is your experience with cloud security?",
    "What is your experience with responsive web design?",
    "What is your experience with parallel programming?",
    "What is your experience with design patterns?",
    "What is your experience with test automation?",
    "What is your experience with network programming?",
    "What is your experience with version control branching strategies?",
    "What is your experience with continuous integration tools?",
    "What is your experience with cloud cost optimization?",
    "What is your experience with web performance optimization?",
    "What is your experience with API security?",
    "What is your experience with data privacy regulations?",
    "What is your experience with serverless computing?",
    "What is your experience with message queues and event-driven architectures?",
    "What is your experience with static code analysis tools?",
    "What is your experience with infrastructure automation?",
    "What is your experience with GraphQL?",
    "What is your experience with load testing and performance tuning?",
    "Are you available for remote work?",
    "Can you work in different time zones?",
    "Are you open to contract work?",
    "Do you have experience with Agile methodologies?",
    "Have you worked in a remote team before?",
    "Do you have experience mentoring junior developers?",
    "Have you contributed to any open-source projects?",
    "Do you have experience with code reviews?",
    "Have you worked in an international team before?",
    "Do you have experience with stakeholder management?",
    "Have you ever led a development team?",
    "Do you have experience with technical writing or documentation?",
    "Have you worked on high-traffic websites or applications?",
    "Do you have experience with A/B testing?",
    "Have you worked in a startup environment?",
    "Do you have experience with legacy code maintenance?",
    "Have you worked on projects requiring regulatory compliance?",
    "Do you have experience with continuous deployment?",
    "Have you worked on projects involving third-party integrations?",
    "Do you have experience with cloud migration projects?",
    "Have you worked on projects requiring high availability and disaster recovery?",
    "Do you have experience with microcontrollers or embedded systems?",
    "Have you worked on projects involving data migration?",
    "Do you have experience with geo-distributed systems?",
    "Have you worked on projects involving real-time analytics?",
    "Do you have experience with cybersecurity practices?",
    "Have you worked on projects involving natural language processing?",
    "Do you have experience with scalable system design?",
    "Have you worked on projects involving image or video processing?",
    "Do you have experience with progressive web apps?",
    "Have you worked on projects involving recommendation systems?",
    "Do you have experience with WebSocket or real-time communication protocols?",
    "Have you worked on projects involving data warehousing?",
    "Do you have experience with search engine optimization techniques?",
    "Have you worked on projects involving content management systems?",
    "Do you have experience with version control systems other than Git?",
    "Have you worked on projects involving geospatial data?",
    "Do you have experience with virtual or augmented reality development?",
    "Have you worked on projects involving voice user interfaces?",
    "Do you have experience with chaos engineering practices?",
    "Are you available for part-time or freelance work?",
    "Can you work on-site occasionally if needed?",
    "Are you open to travel for work if required?",
    "Do you have any upcoming commitments that might affect your availability?",
    "Are you available for weekend or off-hours work occasionally?",
    "Can you start immediately if offered a position?",
    "Are you open to a trial period or probationary employment?",
    "Are you available for part-time or freelance work?",
    "Can you work on-site occasionally if needed?",
    "Are you open to travel for work if required?",
    "Do you have any upcoming commitments that might affect your availability?",
    "Are you available for weekend or off-hours work occasionally?",
    "Can you start immediately if offered a position?",
    "Are you open to a trial period or probationary employment?",
    "Are you willing to relocate for the right opportunity?",
    "Can you work flexible hours if the job requires it?",
    "Are you available for on-call rotations?",
    "Can you commit to a long-term project (1 year or more)?",
    "Are you open to short-term contracts?",
    "Can you attend in-person meetings or events if necessary?",
    "Are you available for international assignments?",
    "Can you work during non-standard business hours to collaborate with global teams?",
    "Are you open to a hybrid work model (part remote, part in-office)?",
    "Can you commit to full-time hours (40 hours per week)?",
    "Are you available for emergency support outside of regular work hours?",
    "Can you attend training or conferences that may require travel?",
    "Are you open to working in a different time zone?",
    "Can you accommodate occasional overtime during busy periods?",
    "Are you available for video calls and virtual meetings?",
    "Can you start work earlier or later than standard business hours if needed?",
    "Are you open to job sharing or split shifts?",
    "Can you commit to regular status updates or daily stand-ups?",
    "Are you available for seasonal or temporary work?",
    "Can you work extended hours to meet project deadlines when necessary?",
    "Are you open to taking on additional responsibilities or roles if needed?",
    "Can you participate in after-hours team building or social events?",
    "Are you available for a second round of interviews or skills assessments?",
        "Are you available for part-time or freelance work?",
    "Can you work on-site occasionally if needed?",
    "Are you open to travel for work if required?",
    "Do you have any upcoming commitments that might affect your availability?",
    "Are you available for weekend or off-hours work occasionally?",
    "Can you start immediately if offered a position?",
    "Are you open to a trial period or probationary employment?",
    "Are you willing to relocate for the right opportunity?",
    "Can you work flexible hours if the job requires it?",
    "Are you available for on-call rotations?",
    "Can you commit to a long-term project (1 year or more)?",
    "Are you open to short-term contracts?",
    "Can you attend in-person meetings or events if necessary?",
    "Are you available for international assignments?",
    "Can you work during non-standard business hours to collaborate with global teams?",
    "Are you open to a hybrid work model (part remote, part in-office)?",
    "Can you commit to full-time hours (40 hours per week)?",
    "Are you available for emergency support outside of regular work hours?",
    "Can you attend training or conferences that may require travel?",
    "Are you open to working in a different time zone?",
    "Can you accommodate occasional overtime during busy periods?",
    "Are you available for video calls and virtual meetings?",
    "Can you start work earlier or later than standard business hours if needed?",
    "Are you open to job sharing or split shifts?",
    "Can you commit to regular status updates or daily stand-ups?",
    "Are you available for seasonal or temporary work?",
    "Can you work extended hours to meet project deadlines when necessary?",
    "Are you open to taking on additional responsibilities or roles if needed?",
    "Can you participate in after-hours team building or social events?",
    "Are you available for a second round of interviews or skills assessments?",
    "Can you be on-site for the first few weeks of employment for onboarding?",
    "Are you willing to work on public holidays if the project requires it?",
    "Can you accommodate last-minute schedule changes?",
    "Are you available for early morning or late night calls with international clients?",
    "Can you commit to a minimum number of hours per week for part-time work?",
    "Are you open to working compressed work weeks (e.g., 4 10-hour days)?",
    "Can you be available during specific core hours each day?",
    "Are you willing to take on shift work if required?",
    "Can you commit to a fixed schedule, or do you need flexibility?",
    "Are you available for periodic performance reviews and feedback sessions?",
    "Can you attend company-wide events or retreats that may be out of town?",
    "Are you open to working extra hours during launch or release periods?",
    "Can you be available for client meetings outside of regular business hours?",
    "Are you willing to be on standby during critical system updates or maintenance?",
    "Can you commit to continuous learning and skill development outside work hours?",
    "Are you available for cross-training in other roles or departments?",
    "Can you work during local holidays in other countries for global projects?",
    "Are you open to taking on rush projects with short turnaround times?",
    "Can you be flexible with your lunch hours to accommodate team schedules?",
    "Are you available for mentoring or training new team members?",
    "Can you commit to regular team brainstorming or strategy sessions?",
    "Are you open to occasional overnight stays for out-of-town projects?",
    "Can you be available for impromptu meetings or urgent issues?",
    "Are you willing to adjust your work hours seasonally if needed?",
    "Can you commit to a minimum tenure if the company invests in your training?",
    "Are you available for rotating shifts in a 24/7 operation environment?",
    "Can you work split shifts if the role requires coverage during peak hours?",
    "Are you open to being on call during major product releases or updates?",
    "Can you commit to a certain response time for urgent communications?",
    "Are you available for periodic team retreats or off-site meetings?",
    "Can you adjust your schedule for daylight saving time changes in different regions?",
    "What is your experience with database management systems?",
    "How familiar are you with cloud computing platforms?",
    "What front-end frameworks have you worked with?",
    "Do you have experience with containerization technologies?",
    "What is your level of expertise in DevOps practices?",
    "Have you worked with any machine learning or AI frameworks?",
    "What version control systems are you comfortable using?",
    "Do you have experience with RESTful API design and development?",
    "What is your proficiency level in data structures and algorithms?",
    "Have you worked with any big data technologies?",
    "What is your experience with agile methodologies?",
    "Do you have any skills in UI/UX design?",
    "What testing frameworks have you used?",
    "Are you familiar with microservices architecture?",
    "What is your experience with serverless computing?",
    "Do you have any skills in cybersecurity?",
    "What is your proficiency in data analysis and visualization?",
    "Have you worked with any content management systems?",
    "What is your experience with mobile app development?",
    "Do you have skills in network programming?",
    "What is your proficiency in concurrent and parallel programming?",
    "Have you worked with any IoT technologies?",
    "What is your experience with blockchain development?",
    "Do you have skills in game development?",
    "What is your proficiency in functional programming?",
    "Have you worked with any AR/VR technologies?",
    "What is your experience with natural language processing?",
    "Do you have skills in embedded systems programming?",
    "What is your proficiency in web scraping and automation?",
    "Have you worked with any graph databases?",
    "What is your experience with continuous integration/continuous deployment (CI/CD) tools?",
    "Do you have skills in technical writing or documentation?",
    "What is your proficiency in shell scripting?",
    "Have you worked with any message brokers or queue systems?",
    "What is your experience with distributed systems?",
    "Do you have skills in performance optimization?",
    "What is your proficiency in reactive programming?",
    "Have you worked with any geographic information systems (GIS)?",
    "What is your experience with search engine optimization (SEO)?",
        "What is your experience with quantum computing frameworks?",
    "How proficient are you in low-level systems programming?",
    "Have you worked with any computer vision libraries?",
    "What is your experience with real-time operating systems (RTOS)?",
    "Do you have skills in reverse engineering or binary analysis?",
    "What is your proficiency in cryptography and secure communication protocols?",
    "Have you worked with any robotic process automation (RPA) tools?",
    "What is your experience with voice user interface (VUI) development?",
    "Do you have skills in developing for wearable devices?",
    "What is your proficiency in edge computing technologies?",
    "Have you worked with any digital signal processing (DSP) techniques?",
    "What is your experience with bioinformatics algorithms and tools?",
    "Do you have skills in developing compilers or interpreters?",
    "What is your proficiency in GPU programming or CUDA?",
    "Have you worked with any recommendation system algorithms?",
    "What is your experience with time series analysis and forecasting?",
    "Do you have skills in developing for smart home technologies?",
    "What is your proficiency in mesh networking protocols?",
    "Have you worked with any privacy-preserving computation techniques?",
    "What is your experience with fuzzy logic systems?",
    "Do you have skills in developing chatbots or conversational AI?",
    "What is your proficiency in probabilistic programming?",
    "Have you worked with any computer-aided design (CAD) software APIs?",
    "What is your experience with algorithmic trading systems?",
    "Do you have skills in developing for autonomous vehicles?",
    "What is your proficiency in developing memory-efficient data structures?",
    "Have you worked with any music technology or audio processing libraries?",
    "What is your experience with geospatial analysis tools?",
    "Do you have skills in developing for e-ink displays?",
    "What is your proficiency in federated learning techniques?",
    "Have you worked with any hardware description languages (HDL)?",
    "What is your experience with optical character recognition (OCR) technologies?",
    "Do you have skills in developing for brain-computer interfaces?",
    "What is your proficiency in swarm intelligence algorithms?",
    "Have you worked with any network simulation tools?",
    "What is your experience with formal verification methods?",
    "Do you have skills in developing for satellite systems?",
    "What is your proficiency in anomaly detection algorithms?",
    "Have you worked with any computational fluid dynamics (CFD) software?",
    "What is your experience with quantum cryptography protocols?"
  ],
  "responses": [
    {"text": "I'm proficient in Python, Java, JavaScript, and C++. I also have experience with Ruby and Go.", "intent": "skills"},
    {"text": "I have 7 years of experience in software development, including 3 years in a senior role.", "intent": "experience"},
    {"text": "I am available for full-time positions starting next month.", "intent": "availability"},
    {"text": "I have extensive experience with AWS and Google Cloud Platform, and some familiarity with Azure.", "intent": "skills"},
    {"text": "I have worked with both SQL (PostgreSQL, MySQL) and NoSQL (MongoDB, Cassandra) databases for over 5 years.", "intent": "experience"},
    {"text": "I have set up and maintained CI/CD pipelines using Jenkins, GitLab CI, and GitHub Actions for the past 3 years.", "intent": "experience"},
    {"text": "I prefer working in a Unix-based environment using VS Code or IntelliJ IDEA, depending on the project.", "intent": "skills"},
    {"text": "I have 3 years of experience with TDD, using frameworks like JUnit and pytest.", "intent": "experience"},
    {"text": "I led the development of a real-time fraud detection system that processes millions of transactions daily.", "intent": "experience"},
    {"text": "I have designed and implemented microservices architectures using Spring Boot and Docker for the past 2 years.", "intent": "experience"},
    {"text": "Yes, I have extensive experience with Docker and have worked with Kubernetes for orchestration over the last 3 years.", "intent": "experience"},
    {"text": "I've worked with React, Angular, and Vue.js for front-end development for a total of 5 years.", "intent": "experience"},
    {"text": "I've designed RESTful APIs and have 2 years of experience with GraphQL.", "intent": "experience"},
    {"text": "I've worked with Hadoop and Spark for big data processing and analysis for the past 3 years.", "intent": "experience"},
    {"text": "I've built serverless applications using AWS Lambda and Google Cloud Functions over the last 2 years.", "intent": "experience"},
    {"text": "I've developed mobile apps for both iOS (Swift) and Android (Kotlin) for a total of 4 years.", "intent": "experience"},
    {"text": "I've implemented Infrastructure as Code using Terraform and automated deployments with Ansible for 3 years.", "intent": "experience"},
    {"text": "Yes, I led a project to migrate a monolithic application to a microservices architecture last year.", "intent": "experience"},
    {"text": "I've worked on a blockchain-based supply chain tracking system using Hyperledger Fabric for 1 year.", "intent": "experience"},
    {"text": "I've used TensorFlow and PyTorch for machine learning projects over the past 2 years.", "intent": "experience"},
    {"text": "I've developed firmware for IoT devices and created a cloud-based platform for device management for 3 years.", "intent": "experience"},
    {"text": "I've used tools like Tableau and D3.js for creating interactive data visualizations for the past 4 years.", "intent": "experience"},
    {"text": "I have experience with functional programming in Haskell and have applied FP principles in JavaScript and Python projects for 2 years.", "intent": "experience"},
    {"text": "I've developed cloud-native applications using microservices, containers, and managed cloud services for 3 years.", "intent": "experience"},
    {"text": "I've worked on real-time systems for financial trading and online gaming platforms over the past 4 years.", "intent": "experience"},
    {"text": "I have a strong foundation in data structures and algorithms, with 7 years of practical application in various projects.", "intent": "skills"},
    {"text": "I ensure my web applications meet WCAG 2.1 guidelines and have been doing so for the past 3 years.", "intent": "experience"},
    {"text": "I have experience designing and implementing distributed systems using technologies like Apache Kafka and gRPC for 4 years.", "intent": "experience"},
    {"text": "I'm proficient with JIRA and have 5 years of experience with Trello and Asana for agile project management.", "intent": "skills"},
    {"text": "I've used React Native and Flutter for cross-platform mobile app development over the last 3 years.", "intent": "experience"},
    {"text": "I'm experienced in optimizing code performance through profiling, algorithm improvements, and data structure selection for 6 years.", "intent": "experience"},
    {"text": "I have 5 years of experience with database normalization, indexing strategies, and query optimization techniques.", "intent": "experience"},
    {"text": "I'm familiar with cloud security best practices, including IAM policies, network security groups, and encryption, with 3 years of hands-on experience.", "intent": "experience"},
    {"text": "I ensure web designs are responsive using CSS media queries, flexbox, and grid layouts, which I've been doing for 5 years.", "intent": "experience"},
    {"text": "I have 4 years of experience with multi-threading in Java and parallel processing using Python's multiprocessing library.", "intent": "experience"},
    {"text": "I've been applying various design patterns in my projects for the past 6 years.", "intent": "experience"},
    {"text": "I have 4 years of experience with test automation using Selenium, Cypress, and Jest.", "intent": "experience"},
    {"text": "I've worked on network programming projects using sockets and protocols like TCP/IP for 3 years.", "intent": "experience"},
    {"text": "I have 5 years of experience with Git flow and other branching strategies in version control.", "intent": "experience"},
    {"text": "I've been using Jenkins, Travis CI, and CircleCI for continuous integration for the past 4 years.", "intent": "experience"},
    {"text": "I have 3 years of experience optimizing cloud costs across AWS, GCP, and Azure.", "intent": "experience"},
    {"text": "I've been focusing on web performance optimization techniques like lazy loading and code splitting for 4 years.", "intent": "experience"},
    {"text": "I have 3 years of experience implementing OAuth, JWT, and other API security measures.", "intent": "experience"},
    {"text": "I've worked on GDPR and CCPA compliance in software projects for the past 2 years.", "intent": "experience"},
    {"text": "I have 3 years of experience building applications with AWS Lambda and Azure Functions.", "intent": "experience"},
    {"text": "I've worked with RabbitMQ and Apache Kafka for building event-driven architectures over the last 4 years.", "intent": "experience"},
    {"text": "I've been using tools like SonarQube and ESLint for static code analysis for 5 years.", "intent": "experience"},
    {"text": "I have 4 years of experience with infrastructure automation using Ansible and Puppet.", "intent": "experience"},
    {"text": "I've been working with GraphQL APIs in production environments for the past 3 years.", "intent": "experience"},
    {"text": "I have 5 years of experience with JMeter and Gatling for load testing and performance tuning.", "intent": "experience"},
    {"text": "Yes, I'm available and equipped for remote work.", "intent": "availability"},
    {"text": "I'm flexible and can adjust my working hours to different time zones if needed.", "intent": "availability"},
    {"text": "Yes, I'm open to contract work as well as full-time positions.", "intent": "availability"},
    {"text": "I have 5 years of experience working in Scrum and Kanban environments.", "intent": "experience"},
    {"text": "Yes, I've been working remotely for the past 2 years and am comfortable with virtual collaboration tools.", "intent": "experience"},
    {"text": "I have 3 years of experience mentoring junior developers, focusing on code quality and best practices.", "intent": "experience"},
    {"text": "Yes, I've contributed to several open-source projects over the past 4 years, including a popular Python library for data analysis.", "intent": "experience"},
    {"text": "I have 5 years of experience conducting code reviews and providing constructive feedback.", "intent": "experience"},
    {"text": "Yes, I've collaborated with team members from different countries for 3 years and am comfortable in a multicultural environment.", "intent": "experience"},
    {"text": "I have 4 years of experience managing stakeholders, including setting expectations and providing regular updates.", "intent": "experience"},
    {"text": "Yes, I've led a development team of 5 engineers for 2 years.", "intent": "experience"},
    {"text": "I have 3 years of experience writing technical documentation, including API docs and system architecture overviews.", "intent": "experience"},
    {"text": "Yes, I've worked on applications handling millions of daily active users over the past 3 years.", "intent": "experience"},
    {"text": "I have 2 years of experience implementing and analyzing A/B tests for feature optimization.", "intent": "experience"},
    {"text": "Yes, I worked at a fast-paced startup for 3 years, wearing multiple hats and adapting to rapid changes.", "intent": "experience"},
    {"text": "I have 4 years of experience maintaining and gradually modernizing legacy codebases.", "intent": "experience"},
    {"text": "Yes, I've worked on projects requiring HIPAA compliance for 2 years in the healthcare sector.", "intent": "experience"},
    {"text": "I have 3 years of experience setting up and maintaining continuous deployment pipelines.", "intent": "experience"},
    {"text": "Yes, I've integrated various third-party APIs and services into projects over the past 5 years.", "intent": "experience"},
    {"text": "I have led 2 major cloud migration projects over the last 3 years, moving on-premises systems to AWS and GCP.", "intent": "experience"},
    {"text": "Yes, I've designed and implemented high availability systems with 99.99% uptime over the past 4 years.", "intent": "experience"},
    {"text": "I have 2 years of experience programming Arduino and Raspberry Pi for IoT projects.", "intent": "experience"},
    {"text": "Yes, I've managed complex data migration projects, including ETL processes, for 3 years.", "intent": "experience"},
    {"text": "I have 2 years of experience designing and implementing geo-distributed systems for global applications.", "intent": "experience"},
    {"text": "Yes, I've worked on real-time analytics dashboards using technologies like Apache Flink for 3 years.", "intent": "experience"},
    {"text": "I have 4 years of experience implementing cybersecurity best practices, including penetration testing and security audits.", "intent": "experience"},
    {"text": "Yes, I've worked on NLP projects using libraries like NLTK and spaCy for 2 years.", "intent": "experience"},
    {"text": "I have 5 years of experience designing scalable systems that can handle rapid growth in users and data.", "intent": "experience"},
    {"text": "Yes, I've worked on computer vision projects using OpenCV and TensorFlow for 2 years.", "intent": "experience"},
    {"text": "I have 3 years of experience developing progressive web apps with offline capabilities and push notifications.", "intent": "experience"},
    {"text": "Yes, I've built recommendation systems using collaborative filtering and content-based approaches for 2 years.", "intent": "experience"},
    {"text": "I have 4 years of experience working with WebSocket protocols for real-time bidirectional communication.", "intent": "experience"},
    {"text": "Yes, I've designed and implemented data warehousing solutions using tools like Snowflake and Redshift for 3 years.", "intent": "experience"},
    {"text": "I have 2 years of experience implementing SEO best practices in web development projects.", "intent": "experience"},
    {"text": "Yes, I've worked with various content management systems like WordPress and Drupal for 5 years.", "intent": "experience"},
    {"text": "I have experience with Mercurial and Subversion in addition to Git, totaling 7 years of version control experience.", "intent": "experience"},
    {"text": "Yes, I've worked on GIS projects using libraries like GeoDjango and PostGIS for 2 years.", "intent": "experience"},
    {"text": "I have 1 year of experience developing AR applications using ARKit and ARCore.", "intent": "experience"},
    {"text": "Yes, I've integrated voice user interfaces using technologies like Alexa Skills Kit and Google Actions for 2 years.", "intent": "experience"},
    {"text": "I have 1 year of experience implementing chaos engineering practices to improve system resilience.", "intent": "experience"},
    {"text": "Yes, I'm available for part-time or freelance work.", "intent": "availability"},
    {"text": "I can work on-site occasionally if needed, with proper notice.", "intent": "availability"},
    {"text": "Yes, I'm open to travel for work if required, up to 25% of the time.", "intent": "availability"},
    {"text": "I have no major upcoming commitments that would affect my availability.", "intent": "availability"},
    {"text": "Yes, I'm available for occasional weekend or off-hours work when necessary.", "intent": "availability"},
    {"text": "I can start a new position within two weeks of an offer.", "intent": "availability"},
    {"text": "Yes, I'm open to a trial period or probationary employment arrangement.", "intent": "availability"},
        {"text": "Yes, I'm available for part-time or freelance work.", "intent": "availability"},
    {"text": "I can work on-site occasionally if needed, with proper notice.", "intent": "availability"},
    {"text": "Yes, I'm open to travel for work if required, up to 25% of the time.", "intent": "availability"},
    {"text": "I have no major upcoming commitments that would affect my availability.", "intent": "availability"},
    {"text": "Yes, I'm available for occasional weekend or off-hours work when necessary.", "intent": "availability"},
    {"text": "I can start a new position within two weeks of an offer.", "intent": "availability"},
    {"text": "Yes, I'm open to a trial period or probationary employment arrangement.", "intent": "availability"},
    {"text": "I'm willing to relocate for the right opportunity, domestically or internationally.", "intent": "availability"},
    {"text": "Yes, I can work flexible hours to accommodate project needs or team schedules.", "intent": "availability"},
    {"text": "I'm available for on-call rotations and can respond promptly to urgent issues.", "intent": "availability"},
    {"text": "Yes, I can commit to long-term projects lasting a year or more.", "intent": "availability"},
    {"text": "I'm open to short-term contracts, ranging from a few months to a year.", "intent": "availability"},
    {"text": "Yes, I can attend in-person meetings or events with advance notice.", "intent": "availability"},
    {"text": "I'm available for international assignments, including extended stays abroad.", "intent": "availability"},
    {"text": "Yes, I can adjust my schedule to work during non-standard hours for global collaboration.", "intent": "availability"},
    {"text": "I'm open to a hybrid work model, splitting time between remote and in-office work.", "intent": "availability"},
    {"text": "Yes, I can commit to full-time hours of 40 or more per week as needed.", "intent": "availability"},
    {"text": "I'm available for emergency support outside regular hours, with a quick response time.", "intent": "availability"},
    {"text": "Yes, I can attend training sessions or conferences, including those requiring travel.", "intent": "availability"},
    {"text": "I'm open to working in a different time zone and adjusting my schedule accordingly.", "intent": "availability"},
    {"text": "Yes, I can accommodate occasional overtime during busy periods or critical project phases.", "intent": "availability"},
    {"text": "I'm fully equipped for and available to participate in video calls and virtual meetings.", "intent": "availability"},
    {"text": "Yes, I can start work earlier or later than standard hours to meet project needs.", "intent": "availability"},
    {"text": "I'm open to job sharing arrangements or split shifts if the role allows for it.", "intent": "availability"},
    {"text": "Yes, I can commit to regular status updates or daily stand-ups as part of the team process.", "intent": "availability"},
    {"text": "I'm available for seasonal or temporary work assignments.", "intent": "availability"},
    {"text": "Yes, I can work extended hours when necessary to meet critical project deadlines.", "intent": "availability"},
    {"text": "I'm open to taking on additional responsibilities or roles as needed by the team or project.", "intent": "availability"},
    {"text": "Yes, I can participate in after-hours team building or social events to foster team cohesion.", "intent": "availability"},
    {"text": "I'm available for additional rounds of interviews or skills assessments as part of the hiring process.", "intent": "availability"},
    {"text": "Yes, I'm available for part-time or freelance work.", "intent": "availability"},
    {"text": "I can work on-site occasionally if needed, with proper notice.", "intent": "availability"},
    {"text": "Yes, I'm open to travel for work if required, up to 25% of the time.", "intent": "availability"},
    {"text": "I have no major upcoming commitments that would affect my availability.", "intent": "availability"},
    {"text": "Yes, I'm available for occasional weekend or off-hours work when necessary.", "intent": "availability"},
    {"text": "I can start a new position within two weeks of an offer.", "intent": "availability"},
    {"text": "Yes, I'm open to a trial period or probationary employment arrangement.", "intent": "availability"},
    {"text": "I'm willing to relocate for the right opportunity, domestically or internationally.", "intent": "availability"},
    {"text": "Yes, I can work flexible hours to accommodate project needs or team schedules.", "intent": "availability"},
    {"text": "I'm available for on-call rotations and can respond promptly to urgent issues.", "intent": "availability"},
    {"text": "Yes, I can commit to long-term projects lasting a year or more.", "intent": "availability"},
    {"text": "I'm open to short-term contracts, ranging from a few months to a year.", "intent": "availability"},
    {"text": "Yes, I can attend in-person meetings or events with advance notice.", "intent": "availability"},
    {"text": "I'm available for international assignments, including extended stays abroad.", "intent": "availability"},
    {"text": "Yes, I can adjust my schedule to work during non-standard hours for global collaboration.", "intent": "availability"},
    {"text": "I'm open to a hybrid work model, splitting time between remote and in-office work.", "intent": "availability"},
    {"text": "Yes, I can commit to full-time hours of 40 or more per week as needed.", "intent": "availability"},
    {"text": "I'm available for emergency support outside regular hours, with a quick response time.", "intent": "availability"},
    {"text": "Yes, I can attend training sessions or conferences, including those requiring travel.", "intent": "availability"},
    {"text": "I'm open to working in a different time zone and adjusting my schedule accordingly.", "intent": "availability"},
    {"text": "Yes, I can accommodate occasional overtime during busy periods or critical project phases.", "intent": "availability"},
    {"text": "I'm fully equipped for and available to participate in video calls and virtual meetings.", "intent": "availability"},
    {"text": "Yes, I can start work earlier or later than standard hours to meet project needs.", "intent": "availability"},
    {"text": "I'm open to job sharing arrangements or split shifts if the role allows for it.", "intent": "availability"},
    {"text": "Yes, I can commit to regular status updates or daily stand-ups as part of the team process.", "intent": "availability"},
    {"text": "I'm available for seasonal or temporary work assignments.", "intent": "availability"},
    {"text": "Yes, I can work extended hours when necessary to meet critical project deadlines.", "intent": "availability"},
    {"text": "I'm open to taking on additional responsibilities or roles as needed by the team or project.", "intent": "availability"},
    {"text": "Yes, I can participate in after-hours team building or social events to foster team cohesion.", "intent": "availability"},
    {"text": "I'm available for additional rounds of interviews or skills assessments as part of the hiring process.", "intent": "availability"},
    {"text": "Yes, I can be on-site for the initial onboarding period to ensure a smooth start.", "intent": "availability"},
    {"text": "I'm willing to work on public holidays if the project timeline requires it.", "intent": "availability"},
    {"text": "Yes, I can be flexible with my schedule and accommodate last-minute changes when necessary.", "intent": "availability"},
    {"text": "I'm available for early morning or late night calls to collaborate with international clients.", "intent": "availability"},
    {"text": "Yes, I can commit to a minimum of 20 hours per week for part-time positions.", "intent": "availability"},
    {"text": "I'm open to working compressed work weeks to maximize productivity and work-life balance.", "intent": "availability"},
    {"text": "Yes, I can be available during core business hours (e.g., 10 AM to 3 PM) every workday.", "intent": "availability"},
    {"text": "I'm willing to take on shift work if the role requires it, including night shifts.", "intent": "availability"},
    {"text": "I can commit to a fixed schedule, but I also appreciate some flexibility when possible.", "intent": "availability"},
    {"text": "Yes, I'm available for regular performance reviews and feedback sessions to ensure continuous improvement.", "intent": "availability"},
    {"text": "I can attend company-wide events or retreats, including those that require out-of-town travel.", "intent": "availability"},
    {"text": "Yes, I'm willing to work extra hours during critical launch or release periods to ensure success.", "intent": "availability"},
    {"text": "I'm available for client meetings outside of regular business hours when necessary.", "intent": "availability"},
    {"text": "Yes, I can be on standby during critical system updates or maintenance windows.", "intent": "availability"},
    {"text": "I'm committed to continuous learning and can dedicate time outside work hours for skill development.", "intent": "availability"},
    {"text": "Yes, I'm available for cross-training opportunities to expand my skill set and support the team.", "intent": "availability"},
    {"text": "I can work during local holidays in other countries to support global projects and teams.", "intent": "availability"},
    {"text": "Yes, I'm open to taking on rush projects and can adjust my schedule for short turnaround times.", "intent": "availability"},
    {"text": "I can be flexible with my lunch hours to accommodate team schedules and meetings.", "intent": "availability"},
    {"text": "Yes, I'm available to mentor or train new team members as part of my role.", "intent": "availability"},
    {"text": "I can commit to regular team brainstorming or strategy sessions, including after-hours if needed.", "intent": "availability"},
    {"text": "Yes, I'm open to occasional overnight stays for out-of-town projects or client visits.", "intent": "availability"},
    {"text": "I can be available for impromptu meetings or to address urgent issues as they arise.", "intent": "availability"},
    {"text": "Yes, I'm willing to adjust my work hours seasonally if the business needs require it.", "intent": "availability"},
    {"text": "I can commit to a minimum tenure of two years if the company invests in substantial training for me.", "intent": "availability"},
    {"text": "Yes, I'm available for rotating shifts in a 24/7 operation environment if required.", "intent": "availability"},
    {"text": "I can work split shifts to provide coverage during peak operational hours.", "intent": "availability"},
    {"text": "Yes, I'm open to being on call during major product releases or critical updates.", "intent": "availability"},
    {"text": "I can commit to a 30-minute response time for urgent communications during on-call hours.", "intent": "availability"},
    {"text": "Yes, I'm available for periodic team retreats or off-site meetings to enhance collaboration.", "intent": "availability"},
    {"text": "I can adjust my schedule to accommodate daylight saving time changes in different regions for global projects.", "intent": "availability"},
    {"text": "I have extensive experience with SQL databases like PostgreSQL and MySQL, as well as NoSQL databases like MongoDB and Cassandra.", "intent": "skills"},
    {"text": "I'm well-versed in AWS and Google Cloud Platform, with some experience in Azure.", "intent": "skills"},
    {"text": "I've worked extensively with React and Vue.js, and have some experience with Angular.", "intent": "skills"},
    {"text": "I'm proficient with Docker and have experience orchestrating containers with Kubernetes.", "intent": "skills"},
    {"text": "I have strong DevOps skills, including experience with CI/CD pipelines, infrastructure as code, and configuration management tools.", "intent": "skills"},
    {"text": "I've worked with TensorFlow and PyTorch for machine learning projects, and have implemented various AI algorithms.", "intent": "skills"},
    {"text": "I'm very comfortable with Git and have also used Mercurial and SVN in past projects.", "intent": "skills"},
    {"text": "I have extensive experience designing and developing RESTful APIs, following best practices for scalability and security.", "intent": "skills"},
    {"text": "I have a strong foundation in data structures and algorithms, regularly solving complex problems and optimizing code.", "intent": "skills"},
    {"text": "I've worked with Hadoop and Spark ecosystems for processing and analyzing large datasets.", "intent": "skills"},
    {"text": "I'm well-versed in Scrum and Kanban methodologies, having worked in agile environments for several years.", "intent": "skills"},
    {"text": "I have basic UI/UX design skills, including wireframing and prototyping using tools like Figma.", "intent": "skills"},
    {"text": "I'm experienced with Jest and Mocha for JavaScript testing, and pytest for Python.", "intent": "skills"},
    {"text": "I have designed and implemented microservices architectures, focusing on scalability and maintainability.", "intent": "skills"},
    {"text": "I've built serverless applications using AWS Lambda and have experience with event-driven architectures.", "intent": "skills"},
    {"text": "I have a good understanding of cybersecurity principles and have implemented secure coding practices in my projects.", "intent": "skills"},
    {"text": "I'm proficient in data analysis using pandas and numpy, and data visualization with matplotlib and D3.js.", "intent": "skills"},
    {"text": "I've worked with WordPress and Drupal, customizing themes and developing plugins.", "intent": "skills"},
    {"text": "I have experience developing mobile apps using React Native for cross-platform development.", "intent": "skills"},
    {"text": "I'm skilled in socket programming and have implemented various network protocols.", "intent": "skills"},
    {"text": "I have experience with multi-threading in Java and parallel processing in Python.", "intent": "skills"},
    {"text": "I've worked on IoT projects using Arduino and Raspberry Pi, integrating sensors and actuators.", "intent": "skills"},
    {"text": "I have basic experience with Ethereum smart contract development using Solidity.", "intent": "skills"},
    {"text": "I've developed small games using Unity and have a good understanding of game development principles.", "intent": "skills"},
    {"text": "I'm proficient in functional programming concepts and have applied them in JavaScript and Scala projects.", "intent": "skills"},
    {"text": "I have some experience with AR development using ARKit for iOS.", "intent": "skills"},
    {"text": "I've worked on NLP projects using NLTK and spaCy, implementing text classification and named entity recognition.", "intent": "skills"},
    {"text": "I have experience programming for embedded systems using C and assembly language.", "intent": "skills"},
    {"text": "I'm skilled in web scraping using Beautiful Soup and Selenium, and have automated various web tasks.", "intent": "skills"},
    {"text": "I've worked with Neo4j for graph database applications, particularly for social network analysis.", "intent": "skills"},
    {"text": "I'm experienced with Jenkins and GitLab CI for setting up and maintaining CI/CD pipelines.", "intent": "skills"},
    {"text": "I have strong technical writing skills, having written API documentation and user guides for several projects.", "intent": "skills"},
    {"text": "I'm proficient in bash scripting and have automated various system administration tasks.", "intent": "skills"},
    {"text": "I've worked with RabbitMQ and Apache Kafka for building scalable, event-driven systems.", "intent": "skills"},
    {"text": "I have experience designing and implementing distributed systems, focusing on consistency and fault tolerance.", "intent": "skills"},
    {"text": "I'm skilled in performance optimization techniques, including profiling, caching, and query optimization.", "intent": "skills"},
    {"text": "I have experience with reactive programming using RxJS in JavaScript projects.", "intent": "skills"},
    {"text": "I've worked with QGIS and PostGIS for spatial data analysis and visualization.", "intent": "skills"},
    {"text": "I have implemented various SEO best practices in web development projects, improving search engine rankings.", "intent": "skills"},
    {"text": "I have basic experience with Qiskit for quantum circuit simulation.", "intent": "skills"},
    {"text": "I'm proficient in C and assembly language for systems programming.", "intent": "skills"},
    {"text": "I've worked extensively with OpenCV for image processing and object detection.", "intent": "skills"},
    {"text": "I have experience developing for FreeRTOS in embedded systems projects.", "intent": "skills"},
    {"text": "I've used IDA Pro and Ghidra for reverse engineering and vulnerability research.", "intent": "skills"},
    {"text": "I'm knowledgeable about symmetric and asymmetric encryption algorithms and have implemented secure communication protocols.", "intent": "skills"},
    {"text": "I've used UiPath for automating repetitive business processes.", "intent": "skills"},
    {"text": "I have experience developing Alexa skills and Google Actions for voice interfaces.", "intent": "skills"},
    {"text": "I've developed applications for Apple Watch using WatchKit.", "intent": "skills"},
    {"text": "I'm familiar with AWS Greengrass for edge computing implementations.", "intent": "skills"},
    {"text": "I've applied various DSP techniques using Python's scipy.signal module.", "intent": "skills"},
    {"text": "I have experience with sequence alignment algorithms and have used tools like BLAST.", "intent": "skills"},
    {"text": "I've built a simple interpreter for a domain-specific language using ANTLR.", "intent": "skills"},
    {"text": "I'm proficient in CUDA programming for parallel computing on NVIDIA GPUs.", "intent": "skills"},
    {"text": "I've implemented collaborative filtering and content-based recommendation algorithms.", "intent": "skills"},
    {"text": "I have experience with ARIMA models and Prophet for time series forecasting.", "intent": "skills"},
    {"text": "I've developed integrations for smart home devices using HomeKit and Google Home.", "intent": "skills"},
    {"text": "I'm familiar with protocols like Zigbee and Thread for mesh networking in IoT.", "intent": "skills"},
    {"text": "I have experience with homomorphic encryption for privacy-preserving computations.", "intent": "skills"},
    {"text": "I've implemented fuzzy logic controllers for industrial automation systems.", "intent": "skills"},
    {"text": "I've developed chatbots using Rasa and integrated them with messaging platforms.", "intent": "skills"},
    {"text": "I have experience with PyMC3 for probabilistic programming and Bayesian inference.", "intent": "skills"},
    {"text": "I've worked with AutoCAD's .NET API to automate drawing tasks.", "intent": "skills"},
    {"text": "I've developed backtesting frameworks for algorithmic trading strategies.", "intent": "skills"},
    {"text": "I have experience with ROS (Robot Operating System) for autonomous vehicle prototyping.", "intent": "skills"},
    {"text": "I've implemented custom memory-efficient data structures like sparse matrices.", "intent": "skills"},
    {"text": "I've used librosa for music information retrieval and audio feature extraction.", "intent": "skills"},
    {"text": "I'm proficient with GeoPandas and Shapely for geospatial data analysis and manipulation.", "intent": "skills"},
    {"text": "I've optimized UI rendering for e-ink displays in embedded Linux systems.", "intent": "skills"},
    {"text": "I have experience implementing federated learning using TensorFlow Federated.", "intent": "skills"},
    {"text": "I've used VHDL for FPGA programming in digital circuit design projects.", "intent": "skills"},
    {"text": "I've integrated Tesseract OCR into document processing pipelines.", "intent": "skills"},
    {"text": "I have basic experience with OpenBCI for EEG signal processing and visualization.", "intent": "skills"},
    {"text": "I've implemented particle swarm optimization algorithms for complex optimization problems.", "intent": "skills"},
    {"text": "I'm familiar with ns-3 for network simulation and protocol evaluation.", "intent": "skills"},
    {"text": "I have experience using TLA+ for specifying and verifying concurrent systems.", "intent": "skills"},
    {"text": "I've worked on ground station software for CubeSat projects using GNU Radio.", "intent": "skills"},
    {"text": "I'm proficient in implementing various anomaly detection techniques, including isolation forests and autoencoders.", "intent": "skills"},
    {"text": "I've used OpenFOAM for simple CFD simulations in engineering projects.", "intent": "skills"},
    {"text": "I have theoretical knowledge of BB84 and other quantum key distribution protocols.", "intent": "skills"}
  ]
}